"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""
products = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]       

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    all_sales = []
    for product in products:
        # переменные ниже, сделаны для удобства читаемости кода
        product_name = product['product']
        sales = product['items_sold']
        total_sales = sum(sales)
        avg_sales = total_sales / len(sales)
        all_sales.extend(sales)
        print(f"Продукт: {product_name}, кол-во продаж: общие - {total_sales}, средние - {avg_sales:.0f}")
    total_sales = sum(all_sales)
    avg_sales = total_sales / len(products)
    print(f"Суммарное количество продаж всех товаров: {total_sales}")
    print(f"Среднее количество продаж всех товаров: {avg_sales}")

if __name__ == "__main__":
    main()
